# Пользователь вводит 3 числа, сказать сколько из них  положительрных и сколько отрицательных
# первый способ на определение положительное или отрицательное
first_num = input('Первое число: ')
print(first_num.isdigit())
second_num = input('Второе число: ')
print(second_num.isdigit())
third_num = input('Третье число: ')
print(third_num.isdigit())

# Дальше случился ступор, как без использование  if  и счетчика посчитать сколько каких чисел.
# Наведи пожалуйста на верное решение