# Пользователь вводит 3 числа, сказать сколько из них  положительрных и сколько отрицательных

first_num = input('Первое число: ')
print(first_num.isdigit())
second_num = input('Второе число: ')
print(second_num.isdigit())
third_num = input('Третье число: ')
print(third_num.isdigit())